# Bài 2 - Hoàn thành notebook sau

### Bước 1.Import các thư viện cần thiết

In [18]:
import pandas as pd

### Bước 2. Đọc file từ url sau đó lưu vào biến user

In [19]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
df=pd.read_csv(url,delimiter="|")

### Bước 3. In 25 dòng đầu tiên

In [20]:
df.head(25)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

### Bước 4. In 10 dòng cuối

In [21]:
df.iloc[-1:-10:-1]

     user_id  age gender     occupation zip_code
942      943   22      M        student    77841
941      942   48      F      librarian    78209
940      941   20      M        student    97229
939      940   32      M  administrator    02215
938      939   26      F        student    33319
937      938   38      F     technician    55038
936      937   48      M       educator    98072
935      936   24      M          other    32789
934      935   42      M         doctor    66221

### Bước 5. Data này có bao nhiêu dòng

In [22]:
print(len(df))

943

### Bước 6. Có bao nhiêu cột, bao gồm những cột nào

In [23]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Bước 7. Kiểu dữ liệu của mỗi columns?

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

### Bước 8. In giá trị của cột occupation

In [27]:
df['occupation']

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### Bước  9. Có bao nhiêu giá trị khác nhau trong cột occupation

In [53]:
dups_occupation = df.pivot_table(index=['occupation'], aggfunc='size')
print(len(dups_occupation))

21

### Bước 10.Tính độ tuổi trung bình

In [54]:
print(df['age'].mean())

34.05196182396607

### Bước 11: Tính độ tuổi trung bình theo occupation

In [55]:
df.groupby('occupation').mean()

                  user_id        age
occupation
administrator  430.949367  38.746835
artist         451.892857  31.392857
doctor         533.714286  43.571429
educator       466.905263  42.010526
engineer       456.328358  36.388060
entertainment  398.000000  29.222222
executive      422.312500  38.718750
healthcare     501.437500  41.562500
homemaker      443.000000  32.571429
lawyer         359.083333  36.750000
librarian      486.588235  40.000000
marketing      437.807692  37.615385
none           368.666667  26.555556
other          542.733333  34.523810
programmer     435.530303  33.121212
retired        515.714286  63.071429
salesman       494.916667  35.666667
scientist      465.129032  35.548387
student        484.954082  22.081633
technician     497.629630  33.148148
writer         495.711111  36.311111

### Bước 12: Với mỗi occupation tình độ tuổi lớn nhất và nhỏ nhất

In [56]:
df.groupby(['occupation'])['age'].max()

occupation
administrator    70
artist           48
doctor           64
educator         63
engineer         70
entertainment    50
executive        69
healthcare       62
homemaker        50
lawyer           53
librarian        69
marketing        55
none             55
other            64
programmer       63
retired          73
salesman         66
scientist        55
student          42
technician       55
writer           60
Name: age, dtype: int64

In [57]:
df.groupby(['occupation'])['age'].min()

occupation
administrator    21
artist           19
doctor           28
educator         23
engineer         22
entertainment    15
executive        22
healthcare       22
homemaker        20
lawyer           21
librarian        23
marketing        24
none             11
other            13
programmer       20
retired          51
salesman         18
scientist        23
student           7
technician       21
writer           18
Name: age, dtype: int64